const app ={
  data(){
    return{
      message:0,
      supportsaddles:[ //鞍式支座数组
      { "id":1 , "D0_容器外径":159 , "h_鞍座高度":200 , "l1_底板":160 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":210 , "b4_垫板":160 , "σ4_垫板":6 , "e_垫板":28 , "l2_螺栓间距":100 ,  },
      { "id":2 , "D0_容器外径":219 , "h_鞍座高度":200 , "l1_底板":210 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":270 , "b4_垫板":160 , "σ4_垫板":6 , "e_垫板":28 , "l2_螺栓间距":140 ,  },
      { "id":3 , "D0_容器外径":273 , "h_鞍座高度":200 , "l1_底板":260 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":330 , "b4_垫板":180 , "σ4_垫板":6 , "e_垫板":38 , "l2_螺栓间距":180 ,  },
      { "id":4 , "D0_容器外径":325 , "h_鞍座高度":200 , "l1_底板":300 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":390 , "b4_垫板":180 , "σ4_垫板":6 , "e_垫板":38 , "l2_螺栓间距":210 ,  },
      { "id":5 , "D0_容器外径":377 , "h_鞍座高度":200 , "l1_底板":350 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":440 , "b4_垫板":180 , "σ4_垫板":6 , "e_垫板":38 , "l2_螺栓间距":250 ,  },
      { "id":6 , "D0_容器外径":426 , "h_鞍座高度":200 , "l1_底板":390 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":500 , "b4_垫板":180 , "σ4_垫板":6 , "e_垫板":38 , "l2_螺栓间距":280 ,  },
      { "id":7 , "D0_容器外径":300 , "h_鞍座高度":200 , "l1_底板":290 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":370 , "b4_垫板":200 , "σ4_垫板":6 , "e_垫板":48 , "l2_螺栓间距":200 ,  },
      { "id":8 , "D0_容器外径":350 , "h_鞍座高度":200 , "l1_底板":330 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":420 , "b4_垫板":200 , "σ4_垫板":6 , "e_垫板":48 , "l2_螺栓间距":230 ,  },
      { "id":9 , "D0_容器外径":400 , "h_鞍座高度":200 , "l1_底板":380 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":480 , "b4_垫板":200 , "σ4_垫板":6 , "e_垫板":48 , "l2_螺栓间距":260 ,  },
      { "id":10 , "D0_容器外径":450 , "h_鞍座高度":200 , "l1_底板":420 , "b1_底板":120 , "σ1_底板":8 , "σ2_腹板":8 , "l3_筋板":NONE , "b3_筋板":96 , "σ3_筋板":8 , "lARC_弧长_垫板":540 , "b4_垫板":200 , "σ4_垫板":6 , "e_垫板":48 , "l2_螺栓间距":290 ,  },
      ]

    } //return
  }//data
}//app
Vue.createApp(app).mount('#app')